app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order("created_at desc").paginate(page: params[:page], per_page: 5)
---
SELECT  "posts".* FROM "posts" ORDER BY created_at desc LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new post_params

    if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    if @post.update post_params
---
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "Test Post 2"], ["updated_at", 2017-03-26 03:22:23 UTC], ["id", 1]]

  def destroy
    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]

  def find_post
    @post = Post.friendly.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]