app/controllers/projects_controller.rb

  def index
    @projects = Project.all.order("created_at desc")
---
SELECT "projects".* FROM "projects" ORDER BY created_at desc

  def create
    @project = Project.new project_params
    if @project.save
---
INSERT INTO "projects" ("title", "description", "link", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "deleted"], ["description", "dleted"], ["link", ""], ["created_at", 2017-04-03 19:07:09 UTC], ["updated_at", 2017-04-03 19:07:09 UTC], ["slug", "deleted"]]

  def destroy
    @project.destroy
---
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 2]]

  def find_project
    @project = Project.friendly.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]